The axis cannot be copied.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCopyRevolveAxis { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCopyRevolveAxis As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCopyRevolveAxis {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CopyPasteFailures Class
  Autodesk.Revit.DB Namespace